NguyennQuangMinh/vi-xu-ly---pic16f877a/ytb phuong tung/video 4.2/giao tiep nut nhan led 7 seg/giao tiep nut nhan voi led 7 seg.X/giao tiep nut nhan led 7 seg.c
/*
 * File:   giao tiep nut nhan led 7 seg.c
 * Author: Nguy?nQuangMinh
 *
 * Created on April 7, 2023, 11:56 AM
 */



// PIC16F887 Configuration Bit Settings

// 'C' source line config statements

// CONFIG1
#pragma config FOSC = HS        // Oscillator Selection bits (HS oscillator: High-speed crystal/resonator on RA6/OSC2/CLKOUT and RA7/OSC1/CLKIN)
#pragma config WDTE = OFF       // Watchdog Timer Enable bit (WDT disabled and can be enabled by SWDTEN bit of the WDTCON register)
#pragma config PWRTE = OFF      // Power-up Timer Enable bit (PWRT disabled)
#pragma config MCLRE = OFF      // RE3/MCLR pin function select bit (RE3/MCLR pin function is digital input, MCLR internally tied to VDD)
#pragma config CP = OFF         // Code Protection bit (Program memory code protection is disabled)
#pragma config CPD = OFF        // Data Code Protection bit (Data memory code protection is disabled)
#pragma config BOREN = ON       // Brown Out Reset Selection bits (BOR enabled)
#pragma config IESO = OFF       // Internal External Switchover bit (Internal/External Switchover mode is disabled)
#pragma config FCMEN = OFF      // Fail-Safe Clock Monitor Enabled bit (Fail-Safe Clock Monitor is disabled)
#pragma config LVP = OFF        // Low Voltage Programming Enable bit (RB3 pin has digital I/O, HV on MCLR must be used for programming)

// CONFIG2
#pragma config BOR4V = BOR40V   // Brown-out Reset Selection bit (Brown-out Reset set to 4.0V)
#pragma config WRT = OFF        // Flash Program Memory Self Write Enable bits (Write protection off)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#include <xc.h>
#include <math.h>
#include <stdio.h>
#define _XTAL_FREQ 4000000

unsigned char led7seg[10]={ 0xC0 , 0xF9 , 0xA4 , 0xB0 , 0x99 , 0x92 , 0x82 , 0xF8 , 0x80 , 0x90 };
unsigned char num_disp;

/*void nhantanggiam()
{
    PORTC = led7seg[num_disp/10];
    PORTD = led7seg[num_disp%10];
    if(RB0 == 0)
    {
        __delay_ms(10);
        while(RB0 == 0)
        {
            if( num_disp < 23 )
            {
                num_disp++;
            }
            else 
            {
                num_disp =0;
            }
            __delay_ms(300);
        }
    }
    if(RB1 == 0)
    {
        __delay_ms(10);
        while(RB1 == 0)
        {
            if( num_disp > 0 )
            {
                num_disp--;
            }
            else 
            {
                num_disp =23;
            }
            __delay_ms(300);
            }
        }
}
*/

void main(void) {
    ANSEL = ANSELH = 0x00;
    TRISC = 0x00;
    TRISD= 0x00;
    TRISB0 = 1;
    TRISB1 = 1;
    nRBPU = 0;
    WPUB0 = 1;
    WPUB1 =1;
    num_disp = 0;
    while(1)
    {
//        nhantanggiam();
//        nhantudongtang_giam();
    PORTC = led7seg[num_disp];
    if(RB0 == 0)
    {
        __delay_ms(10);
        while(RB0==0)
        {
            for(num_disp=0;num_disp <9;num_disp++)
            {
                if(RB1==0)
                {
                    break;
                }
            }
            PORTC = led7seg[num_disp%10];
            __delay_ms(500);
        }
    }
    }
}
